// var
// name = 'ГРУТ';
// admin = name;
// alert(admin);

//1.03//

//1.04//

// var
// earth = 'Земля';
// user = 'Билли Херингтон'

// console.log(earth);
// console.log('Текущий пользователь: ' + user);


//1.06//
// let name = "Ilya";
// alert( `hello ${1}` ); // hello 1
// alert( `hello ${"name"}` ); // hello name
// alert( `hello ${name}` ); // hello Ilya

// //01.5
// var
// qwerty//Верно
// МеняЗовутЛеня//Верно
//カカカカ//Верно
//@Greg = 5;//Не верно
// $ Greg//Пробел в переменных не используется
//$Greg//Верно
//_$//Верно
//_Greg//Верно
// 1Greg //Первый символ не должен быть цифрой
//Greg1//Верно
//$//Верно
// _//Верно
//^//Не верно
//@//Не верно


//01.10
// "" + 1 + 0//Ответ = 10;
// "" - 1 + 0//Ответ = -1;
// true + false//Ответ = 1;
// 6 / "3"//Ответ = 2;
// "2" * "3"//Ответ = 6;
// 4 + 5 + "px"//Ответ = 9px;
// "$" + 4 + 5//Ответ = $45;
// "4" - 2//Ответ = 2;
// "4px" - 2//Ответ = NaN - не число ;
// 7 / 0 //Ответ = Infinity;
// "-9" + 5//Ответ = -95;
// " -9 " - 5//Ответ = -14;
// + 1//Ответ = 1;
// undefined + 1//Ответ = NaN;
// " \t \n" – 2//Ответ = Uncaught SyntaxError: Invalid or unexpected token.